{
    "vocab_size": 128256,
    "tie_word_embeddings": false,
    "max_position_embeddings": 8192,
    "rope_theta": 500000.0,
    "rope_scaling": null,
    "hidden_size": 4096,
    "num_hidden_layers": 32,
    "rms_norm_eps": 1e-05,
    "num_attention_heads": 32,
    "num_key_value_heads": 8,
    "intermediate_size": 14336,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "model_type": "llama",
    "architectures": [
        "LlamaForCausalLM"
    ]
}